public static class Program
{
    public static void Main()
    {
        Boolean createNew;

        // Пытаемся создать объект ядра с указанным именем
        using (new Semaphore(0, 1, "SomeUniqueStringIdentifyingMyApp", out createNew))
        {
            if (createNew)
            {
                // Этот поток создаёт ядро, так что другие копии приложения
                // не смогут запускаться. 
                // Выполняем остальную часть приложения ...
            }
            else
            {
                // Этот поток открывает существующее ядро с тем же именем
                // должна запускаться другая копия приложения
                // ничего не делаем, ждём возвращения управления от метода Main,
                // чтобы завершить вторую копию приложения
            }
        }
    }
}